index.org
# -*- mode: org; -*-

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/bigblow.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>

#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/bigblow/js/jquery-1.11.0.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/bigblow/js/jquery-ui-1.10.2.min.js"></script>

#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/bigblow/js/jquery.localscroll-min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/bigblow/js/jquery.scrollTo-1.4.3.1-min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/bigblow/js/jquery.zclip.min.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/bigblow/js/bigblow.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/bigblow/js/hideshow.js"></script>
#+HTML_HEAD: <script type="text/javascript" src="http://www.pirilampo.org/styles/lib/js/jquery.stickytableheaders.min.js"></script>
# #+HTML_HEAD: <script> var HS_STARTUP_FOLDED = true; </script>

# Settings https://github.com/fniessen/refcard-org-mode

#+TITLE:     MEB Advanced R group
#+AUTHOR:    Andreas Karlsson

#+DESCRIPTION: Study group for R users at MEB
#+KEYWORDS:  R, statistics, biostatistics, epidemiology
#+LANGUAGE:  en

* Purpose
There is a lot of knowledge and advanced usage of R within MEB. It
would be nice to be able to share some of that knowledge. Preferably
this could be done without creating too much extra work.
* Meetings & presentations
** TODO R environments                                               :Johan:
<2016-05-12 Thu 10:30-11:30>
+ Presenter: Johan
+ Location: Wargentin
+ Recommended reading before meeting: [[http://adv-r.had.co.nz/Environments.html]]
** DONE Robust variance                                              :Arvid:
<2016-04-21 Thu 10:30-11:30>
+ Presenter: Arvid
+ Presentation: [[file:presentations/sandwich.pdf][The sandwich formula]]
#+begin_caution
+ Location: Tomtebodavägen 18A, Room: Marie
#+end_caution
** DONE Meetings  <2016-03-31 Thu>
*** Attendees
Xingrong, Elisabeth, Andreas, Nathalie, Henric, Arvid, Peter, Mark and Alex
*** Decisions
+ The meeting will take place every three weeks.
+ The meeting format will be casual with one person presenting
  (inspired by the applied biostat group).
+ There were also discussions regarding a reading group with particular
  interest in the Advanced R book http://adv-r.had.co.nz/.
* Potential topics pool
The assigned names here are only _preliminary_.
** Making R-packages
*** Documentation
+ Roxygen
+ Rmarkdown
*** Testing
+ testthat
+ assertthat
+ r-travis
*** Debugging                                                      :Henric:
+ traceback
+ debug
+ browser
+ trace
+ recover
[[http://www.biostat.jhsph.edu/~rpeng/docs/R-debug-tools.pdf]]
**** Rcpp
+ Valgrind
*** Profiling                                                      :Henric:
+ Rprof
+ lineprof
+ microbenchmark
**** Rcpp
+ Valgrind
** Permutation test                                                 :Henric:
+ coin package
** Data analysis                                                       :Alex:
+ Hmisc, multcomp, car
+ non-linear contrasts, car??
** Work flow                                                           :Alex:
+ literate programming
** Splines                                                        :Xingrong:
+ Xingrong
** Extending R
*** Rcpp                                                             :Mark:
+ Rcpp
+ Armadillo
*** JS                                                      :Andreas:Tobba:
rCharts, plotly, ggvis & htmlwidgets
** Speeding up R
*** Multi-core                                                     :Henric:
+ parallel, foreach, snow
+ openmp?
*** Multi-node
+ Rmpi, RHadoop
*** Compiled R code                                                :Henric:
Compiling R code using LLVM by Duncan Temple Lang:
http://projecteuclid.org/download/pdfview_1/euclid.ss/1408368570
** Plotting
*** ggplot2                                                        :Robert:
More advanced version of Roberts student seminar
** Data Management                                                 :Andreas:
+ dplyr, data.table, sqldf and base
+ DB queries from R
** General coding schemes
The distinction between *functional* OOP, as in S3 and S4, and
Java/C++-style *encapsulated* OOP, as in Reference Classes and
R6. Here’s a link to nice paper by John Chambers
http://projecteuclid.org/download/pdfview_1/euclid.ss/1408368569
discussing these issues. For more on this, the paper has now grown
into a book that’ll be published later this year:
https://www.crcpress.com/Extending-R/Chambers/9781498775717
*** R classes and object oriented coding in R                 :Alex:Henric:
+ Classes inheritance
+ S3, Alex
  http://www.cyclismo.org/tutorial/R/s3Classes.html
+ S4, Henric
+ Operators?
*** Functional coding in R                                           :Mark:
    + Functional-packages
      + https://cran.r-project.org/web/packages/functional/functional.pdf
      + https://cartesianfaith.files.wordpress.com/2015/05/rowe-modeling-data-with-functional-programming-chs1-4.pdf
    + Closures
      + http://adv-r.had.co.nz/Functional-programming.html
    + Currying
      + https://gist.github.com/natalinobusa/7747871
    + Tail recursion
    + Lambda-functions
      + http://stackoverflow.com/questions/7833173/lambda-like-functions-in-r
    + Macros
      + http://www.r-bloggers.com/macros-in-r/
      + Programmer’s Niche: Macros in R: https://www.r-project.org/doc/Rnews/Rnews_2001-3.pdf
    + Monads and Gonads?
    + Functors?
** Hosting R processes                                             :Andreas:
+ shiny
+ opencpu
*** Server misc
+ rocker
+ Rstudio-server
** Simulation
+ for evaluating sampling techniques
+ comparing estimates from various methods
+ https://www.jstatsoft.org/article/view/v069i04
*** Bootstrapping
*** Reporting simulation results
+ Graph and table designs
** Machine Learning
+ Caret package: https://topepo.github.io/caret/index.html
+ Interview with Max Kuhn:
  http://machinelearningmastery.com/caret-r-package-for-applied-predictive-modeling/
+ Applied Predictive Modeling book:
  http://appliedpredictivemodeling.com/

** Misc
+ GAMS
+ Imputation
+ R and version control
* Read & discuss
+ http://adv-r.had.co.nz/
+ *R cookbook*
+ *Applied Predictive Modeling* by Max Kuhn and Kjell Johnson
* Other activities
+ Introduce R to new users within MEB
+ Offer courses in R
+ Host Stockholm R useR (SRUG) group meetup at MEB
+ Reuse some study-group material for SRUG presentation
