index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-04-25 Mon 13:07 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>MEB Advanced R group</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Andreas Karlsson" />
<meta  name="description" content="Study group for R users at MEB"
 />
<meta  name="keywords" content="R, statistics, biostatistics, epidemiology" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/bigblow/css/hideshow.css"/>
</head>
<body>
<div id="content">
<h1 class="title">MEB Advanced R group</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Purpose</a></li>
<li><a href="#orgheadline7">2. Meetings &amp; presentations</a>
<ul>
<li><a href="#orgheadline2">2.1. <span class="todo TODO">TODO</span> R environments&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Johan">Johan</span></span></a></li>
<li><a href="#orgheadline3">2.2. <span class="done DONE">DONE</span> Robust variance&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Arvid">Arvid</span></span></a></li>
<li><a href="#orgheadline6">2.3. <span class="done DONE">DONE</span> Meetings  <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-03-31 Thu&gt;</span></span></a>
<ul>
<li><a href="#orgheadline4">2.3.1. Attendees</a></li>
<li><a href="#orgheadline5">2.3.2. Decisions</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline40">3. Potential topics pool</a>
<ul>
<li><a href="#orgheadline14">3.1. Making R-packages</a>
<ul>
<li><a href="#orgheadline8">3.1.1. Documentation</a></li>
<li><a href="#orgheadline9">3.1.2. Testing</a></li>
<li><a href="#orgheadline11">3.1.3. Debugging&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Henric">Henric</span></span></a></li>
<li><a href="#orgheadline13">3.1.4. Profiling&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Henric">Henric</span></span></a></li>
</ul>
</li>
<li><a href="#orgheadline15">3.2. Permutation test&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Henric">Henric</span></span></a></li>
<li><a href="#orgheadline16">3.3. Data analysis&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Alex">Alex</span></span></a></li>
<li><a href="#orgheadline17">3.4. Work flow&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Alex">Alex</span></span></a></li>
<li><a href="#orgheadline18">3.5. Splines&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Xingrong">Xingrong</span></span></a></li>
<li><a href="#orgheadline21">3.6. Extending R</a>
<ul>
<li><a href="#orgheadline19">3.6.1. Rcpp&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Mark">Mark</span></span></a></li>
<li><a href="#orgheadline20">3.6.2. JS&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Andreas">Andreas</span>&#xa0;<span class="Tobba">Tobba</span></span></a></li>
</ul>
</li>
<li><a href="#orgheadline25">3.7. Speeding up R</a>
<ul>
<li><a href="#orgheadline22">3.7.1. Multi-core&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Henric">Henric</span></span></a></li>
<li><a href="#orgheadline23">3.7.2. Multi-node</a></li>
<li><a href="#orgheadline24">3.7.3. Compiled R code&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Henric">Henric</span></span></a></li>
</ul>
</li>
<li><a href="#orgheadline27">3.8. Plotting</a>
<ul>
<li><a href="#orgheadline26">3.8.1. ggplot2&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Robert">Robert</span></span></a></li>
</ul>
</li>
<li><a href="#orgheadline28">3.9. Data Management&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Andreas">Andreas</span></span></a></li>
<li><a href="#orgheadline31">3.10. General coding schemes</a>
<ul>
<li><a href="#orgheadline29">3.10.1. R classes and object oriented coding in R&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Alex">Alex</span>&#xa0;<span class="Henric">Henric</span></span></a></li>
<li><a href="#orgheadline30">3.10.2. Functional coding in R&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Mark">Mark</span></span></a></li>
</ul>
</li>
<li><a href="#orgheadline33">3.11. Hosting R processes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Andreas">Andreas</span></span></a>
<ul>
<li><a href="#orgheadline32">3.11.1. Server misc</a></li>
</ul>
</li>
<li><a href="#orgheadline36">3.12. Simulation</a>
<ul>
<li><a href="#orgheadline34">3.12.1. Bootstrapping</a></li>
<li><a href="#orgheadline35">3.12.2. Reporting simulation results</a></li>
</ul>
</li>
<li><a href="#orgheadline38">3.13. Predictive modelling&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Peter">Peter</span></span></a>
<ul>
<li><a href="#orgheadline37">3.13.1. Machine Learning</a></li>
</ul>
</li>
<li><a href="#orgheadline39">3.14. Misc</a></li>
</ul>
</li>
<li><a href="#orgheadline41">4. Read &amp; discuss</a></li>
<li><a href="#orgheadline42">5. Other activities</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Purpose</h2>
<div class="outline-text-2" id="text-1">
<p>
There is a lot of knowledge and advanced usage of R within MEB. It
would be nice to be able to share some of that knowledge. Preferably
this could be done without creating too much extra work.
</p>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">2</span> Meetings &amp; presentations</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> R environments&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Johan">Johan</span></span></h3>
<div class="outline-text-3" id="text-2-1">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2016-05-12 Thu 10:30&gt;&#x2013;&lt;2016-05-12 Thu 11:30&gt;</span></span>
</p>
<ul class="org-ul">
<li>Presenter: Johan</li>
<li>Location: Wargentin</li>
<li>Recommended reading before meeting: <a href="http://adv-r.had.co.nz/Environments.html">http://adv-r.had.co.nz/Environments.html</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">2.2</span> <span class="done DONE">DONE</span> Robust variance&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Arvid">Arvid</span></span></h3>
<div class="outline-text-3" id="text-2-2">
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2016-04-21 Thu 10:30&gt;&#x2013;&lt;2016-04-21 Thu 11:30&gt;</span></span>
</p>
<ul class="org-ul">
<li>Presenter: Arvid</li>
<li>Presentation: <a href="presentations/sandwich.pdf">The sandwich formula</a></li>
</ul>
<div class="caution">
<ul class="org-ul">
<li>Location: Tomtebodavägen 18A, Room: Marie</li>
</ul>

</div>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">2.3</span> <span class="done DONE">DONE</span> Meetings  <span class="timestamp-wrapper"><span class="timestamp">&lt;2016-03-31 Thu&gt;</span></span></h3>
<div class="outline-text-3" id="text-2-3">
</div><div id="outline-container-orgheadline4" class="outline-4">
<h4 id="orgheadline4"><span class="section-number-4">2.3.1</span> Attendees</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Xingrong, Elisabeth, Andreas, Nathalie, Henric, Arvid, Peter, Mark and Alex
</p>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-4">
<h4 id="orgheadline5"><span class="section-number-4">2.3.2</span> Decisions</h4>
<div class="outline-text-4" id="text-2-3-2">
<ul class="org-ul">
<li>The meeting will take place every three weeks.</li>
<li>The meeting format will be casual with one person presenting
(inspired by the applied biostat group).</li>
<li>There were also discussions regarding a reading group with particular
interest in the Advanced R book <a href="http://adv-r.had.co.nz/">http://adv-r.had.co.nz/</a>.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline40" class="outline-2">
<h2 id="orgheadline40"><span class="section-number-2">3</span> Potential topics pool</h2>
<div class="outline-text-2" id="text-3">
<p>
The assigned names here are only <span class="underline">preliminary</span>.
</p>
</div>
<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">3.1</span> Making R-packages</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-orgheadline8" class="outline-4">
<h4 id="orgheadline8"><span class="section-number-4">3.1.1</span> Documentation</h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>Roxygen</li>
<li>Rmarkdown</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-4">
<h4 id="orgheadline9"><span class="section-number-4">3.1.2</span> Testing</h4>
<div class="outline-text-4" id="text-3-1-2">
<ul class="org-ul">
<li>testthat</li>
<li>assertthat</li>
<li>r-travis</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11"><span class="section-number-4">3.1.3</span> Debugging&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Henric">Henric</span></span></h4>
<div class="outline-text-4" id="text-3-1-3">
<ul class="org-ul">
<li>traceback</li>
<li>debug</li>
<li>browser</li>
<li>trace</li>
<li>recover</li>
</ul>
<p>
<a href="http://www.biostat.jhsph.edu/~rpeng/docs/R-debug-tools.pdf">http://www.biostat.jhsph.edu/~rpeng/docs/R-debug-tools.pdf</a>
</p>
</div>
<ol class="org-ol"><li><a id="orgheadline10"></a>Rcpp<br  /><div class="outline-text-5" id="text-3-1-3-1">
<ul class="org-ul">
<li>Valgrind</li>
</ul>
</div></li></ol>
</div>
<div id="outline-container-orgheadline13" class="outline-4">
<h4 id="orgheadline13"><span class="section-number-4">3.1.4</span> Profiling&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Henric">Henric</span></span></h4>
<div class="outline-text-4" id="text-3-1-4">
<ul class="org-ul">
<li>Rprof</li>
<li>lineprof</li>
<li>microbenchmark</li>
</ul>
</div>
<ol class="org-ol"><li><a id="orgheadline12"></a>Rcpp<br  /><div class="outline-text-5" id="text-3-1-4-1">
<ul class="org-ul">
<li>Valgrind</li>
</ul>
</div></li></ol>
</div>
</div>
<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">3.2</span> Permutation test&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Henric">Henric</span></span></h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>coin package</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">3.3</span> Data analysis&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Alex">Alex</span></span></h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>Hmisc, multcomp, car</li>
<li>non-linear contrasts, car??</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">3.4</span> Work flow&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Alex">Alex</span></span></h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>literate programming</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">3.5</span> Splines&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Xingrong">Xingrong</span></span></h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>Xingrong</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline21" class="outline-3">
<h3 id="orgheadline21"><span class="section-number-3">3.6</span> Extending R</h3>
<div class="outline-text-3" id="text-3-6">
</div><div id="outline-container-orgheadline19" class="outline-4">
<h4 id="orgheadline19"><span class="section-number-4">3.6.1</span> Rcpp&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Mark">Mark</span></span></h4>
<div class="outline-text-4" id="text-3-6-1">
<ul class="org-ul">
<li>Rcpp</li>
<li>Armadillo</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline20" class="outline-4">
<h4 id="orgheadline20"><span class="section-number-4">3.6.2</span> JS&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Andreas">Andreas</span>&#xa0;<span class="Tobba">Tobba</span></span></h4>
<div class="outline-text-4" id="text-3-6-2">
<p>
rCharts, plotly, ggvis &amp; htmlwidgets
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline25" class="outline-3">
<h3 id="orgheadline25"><span class="section-number-3">3.7</span> Speeding up R</h3>
<div class="outline-text-3" id="text-3-7">
</div><div id="outline-container-orgheadline22" class="outline-4">
<h4 id="orgheadline22"><span class="section-number-4">3.7.1</span> Multi-core&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Henric">Henric</span></span></h4>
<div class="outline-text-4" id="text-3-7-1">
<ul class="org-ul">
<li>parallel, foreach, snow</li>
<li>openmp?</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline23" class="outline-4">
<h4 id="orgheadline23"><span class="section-number-4">3.7.2</span> Multi-node</h4>
<div class="outline-text-4" id="text-3-7-2">
<ul class="org-ul">
<li>Rmpi, RHadoop</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24"><span class="section-number-4">3.7.3</span> Compiled R code&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Henric">Henric</span></span></h4>
<div class="outline-text-4" id="text-3-7-3">
<p>
Compiling R code using LLVM by Duncan Temple Lang:
<a href="http://projecteuclid.org/download/pdfview_1/euclid.ss/1408368570">http://projecteuclid.org/download/pdfview_1/euclid.ss/1408368570</a>
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline27" class="outline-3">
<h3 id="orgheadline27"><span class="section-number-3">3.8</span> Plotting</h3>
<div class="outline-text-3" id="text-3-8">
</div><div id="outline-container-orgheadline26" class="outline-4">
<h4 id="orgheadline26"><span class="section-number-4">3.8.1</span> ggplot2&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Robert">Robert</span></span></h4>
<div class="outline-text-4" id="text-3-8-1">
<p>
More advanced version of Roberts student seminar
</p>
</div>
</div>
</div>
<div id="outline-container-orgheadline28" class="outline-3">
<h3 id="orgheadline28"><span class="section-number-3">3.9</span> Data Management&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Andreas">Andreas</span></span></h3>
<div class="outline-text-3" id="text-3-9">
<ul class="org-ul">
<li>dplyr, data.table, sqldf and base</li>
<li>DB queries from R</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline31" class="outline-3">
<h3 id="orgheadline31"><span class="section-number-3">3.10</span> General coding schemes</h3>
<div class="outline-text-3" id="text-3-10">
<p>
The distinction between <b>functional</b> OOP, as in S3 and S4, and
Java/C++-style <b>encapsulated</b> OOP, as in Reference Classes and
R6. Here’s a link to nice paper by John Chambers
<a href="http://projecteuclid.org/download/pdfview_1/euclid.ss/1408368569">http://projecteuclid.org/download/pdfview_1/euclid.ss/1408368569</a>
discussing these issues. For more on this, the paper has now grown
into a book that’ll be published later this year:
<a href="https://www.crcpress.com/Extending-R/Chambers/9781498775717">https://www.crcpress.com/Extending-R/Chambers/9781498775717</a>
</p>
</div>
<div id="outline-container-orgheadline29" class="outline-4">
<h4 id="orgheadline29"><span class="section-number-4">3.10.1</span> R classes and object oriented coding in R&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Alex">Alex</span>&#xa0;<span class="Henric">Henric</span></span></h4>
<div class="outline-text-4" id="text-3-10-1">
<ul class="org-ul">
<li>Classes inheritance</li>
<li>S3, Alex
<a href="http://www.cyclismo.org/tutorial/R/s3Classes.html">http://www.cyclismo.org/tutorial/R/s3Classes.html</a></li>
<li>S4, Henric</li>
<li>Operators?</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline30" class="outline-4">
<h4 id="orgheadline30"><span class="section-number-4">3.10.2</span> Functional coding in R&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Mark">Mark</span></span></h4>
<div class="outline-text-4" id="text-3-10-2">
<ul class="org-ul">
<li>Functional-packages
<ul class="org-ul">
<li><a href="https://cran.r-project.org/web/packages/functional/functional.pdf">https://cran.r-project.org/web/packages/functional/functional.pdf</a></li>
<li><a href="https://cartesianfaith.files.wordpress.com/2015/05/rowe-modeling-data-with-functional-programming-chs1-4.pdf">https://cartesianfaith.files.wordpress.com/2015/05/rowe-modeling-data-with-functional-programming-chs1-4.pdf</a></li>
</ul></li>
<li>Closures
<ul class="org-ul">
<li><a href="http://adv-r.had.co.nz/Functional-programming.html">http://adv-r.had.co.nz/Functional-programming.html</a></li>
</ul></li>
<li>Currying
<ul class="org-ul">
<li><a href="https://gist.github.com/natalinobusa/7747871">https://gist.github.com/natalinobusa/7747871</a></li>
</ul></li>
<li>Tail recursion</li>
<li>Lambda-functions
<ul class="org-ul">
<li><a href="http://stackoverflow.com/questions/7833173/lambda-like-functions-in-r">http://stackoverflow.com/questions/7833173/lambda-like-functions-in-r</a></li>
</ul></li>
<li>Macros
<ul class="org-ul">
<li><a href="http://www.r-bloggers.com/macros-in-r/">http://www.r-bloggers.com/macros-in-r/</a></li>
<li>Programmer’s Niche: Macros in R: <a href="https://www.r-project.org/doc/Rnews/Rnews_2001-3.pdf">https://www.r-project.org/doc/Rnews/Rnews_2001-3.pdf</a></li>
</ul></li>
<li>Monads and Gonads?</li>
<li>Functors?</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline33" class="outline-3">
<h3 id="orgheadline33"><span class="section-number-3">3.11</span> Hosting R processes&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Andreas">Andreas</span></span></h3>
<div class="outline-text-3" id="text-3-11">
<ul class="org-ul">
<li>shiny</li>
<li>opencpu</li>
</ul>
</div>
<div id="outline-container-orgheadline32" class="outline-4">
<h4 id="orgheadline32"><span class="section-number-4">3.11.1</span> Server misc</h4>
<div class="outline-text-4" id="text-3-11-1">
<ul class="org-ul">
<li>rocker</li>
<li>Rstudio-server</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline36" class="outline-3">
<h3 id="orgheadline36"><span class="section-number-3">3.12</span> Simulation</h3>
<div class="outline-text-3" id="text-3-12">
<ul class="org-ul">
<li>for evaluating sampling techniques</li>
<li>comparing estimates from various methods</li>
<li><a href="https://www.jstatsoft.org/article/view/v069i04">https://www.jstatsoft.org/article/view/v069i04</a></li>
</ul>
</div>
<div id="outline-container-orgheadline34" class="outline-4">
<h4 id="orgheadline34"><span class="section-number-4">3.12.1</span> Bootstrapping</h4>
</div>
<div id="outline-container-orgheadline35" class="outline-4">
<h4 id="orgheadline35"><span class="section-number-4">3.12.2</span> Reporting simulation results</h4>
<div class="outline-text-4" id="text-3-12-2">
<ul class="org-ul">
<li>Graph and table designs</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline38" class="outline-3">
<h3 id="orgheadline38"><span class="section-number-3">3.13</span> Predictive modelling&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Peter">Peter</span></span></h3>
<div class="outline-text-3" id="text-3-13">
<ul class="org-ul">
<li>Applied Predictive Modeling book:
<a href="http://appliedpredictivemodeling.com/">http://appliedpredictivemodeling.com/</a></li>
</ul>
</div>
<div id="outline-container-orgheadline37" class="outline-4">
<h4 id="orgheadline37"><span class="section-number-4">3.13.1</span> Machine Learning</h4>
<div class="outline-text-4" id="text-3-13-1">
<ul class="org-ul">
<li>Caret package: <a href="https://topepo.github.io/caret/index.html">https://topepo.github.io/caret/index.html</a></li>
<li>Interview with Max Kuhn:
<a href="http://machinelearningmastery.com/caret-r-package-for-applied-predictive-modeling/">http://machinelearningmastery.com/caret-r-package-for-applied-predictive-modeling/</a></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgheadline39" class="outline-3">
<h3 id="orgheadline39"><span class="section-number-3">3.14</span> Misc</h3>
<div class="outline-text-3" id="text-3-14">
<ul class="org-ul">
<li>GAMS</li>
<li>Imputation</li>
<li>R and version control</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgheadline41" class="outline-2">
<h2 id="orgheadline41"><span class="section-number-2">4</span> Read &amp; discuss</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="http://adv-r.had.co.nz/">http://adv-r.had.co.nz/</a></li>
<li><b>R cookbook</b></li>
<li><b>Applied Predictive Modeling</b> by Max Kuhn and Kjell Johnson</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline42" class="outline-2">
<h2 id="orgheadline42"><span class="section-number-2">5</span> Other activities</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>Introduce R to new users within MEB</li>
<li>Offer courses in R</li>
<li>Host Stockholm R useR (SRUG) group meetup at MEB</li>
<li>Reuse some study-group material for SRUG presentation</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Andreas Karlsson</p>
<p class="date">Created: 2016-04-25 Mon 13:07</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
